particle-iot/device-os/hal/src/nRF52840/exflash_hal.cpp
/*
 * Copyright (c) 2022 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHAN'TABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "exflash_hal.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <inttypes.h>
#include <algorithm>
#include "nrfx_qspi.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "app_util_platform.h"
#include "app_error.h"
#include "hw_config.h"
#include "logging.h"
#include "flash_common.h"
#include "nrf_nvic.h"
#include "concurrent_hal.h"
#include "gpio_hal.h"
#include "system_error.h"
#include "nrf_system_error.h"
#include "check.h"
#include "check_nrf.h"
#include "exflash_hal_params.h"

#define NRF_QSPI_DEFAULT_CINSTR(opc, len)   \
{                                           \
    .opcode    = (opc),                     \
    .length    = (len),                     \
    .io2_level = true,                      \
    .io3_level = true,                      \
    .wipwait   = true,                      \
    .wren      = true                       \
}

#define NRF_QSPI_QUICK_CFG(cmd_writeoc, cmd_readocc, clock_frequenccy)  \
{                                                                       \
    .xip_offset  = NRFX_QSPI_CONFIG_XIP_OFFSET,                         \
    .pins = {                                                           \
        .sck_pin     = QSPI_FLASH_SCK_PIN,                              \
        .csn_pin     = QSPI_FLASH_CSN_PIN,                              \
        .io0_pin     = QSPI_FLASH_IO0_PIN,                              \
        .io1_pin     = QSPI_FLASH_IO1_PIN,                              \
        .io2_pin     = QSPI_FLASH_IO2_PIN,                              \
        .io3_pin     = QSPI_FLASH_IO3_PIN,                              \
    },                                                                  \
    .prot_if = {                                                        \
        .readoc     = cmd_readocc,                                      \
        .writeoc    = cmd_writeoc,                                      \
        .addrmode   = NRF_QSPI_ADDRMODE_24BIT,                          \
        .dpmconfig  = false,                                            \
    },                                                                  \
    .phy_if = {                                                         \
        .sck_delay  = 1,  /* 62.5ns */                                  \
        .dpmen      = false,                                            \
        .spi_mode   = NRF_QSPI_MODE_0,                                  \
        .sck_freq   = clock_frequenccy                                  \
    },                                                                  \
    .irq_priority   = (uint8_t)QSPI_FLASH_IRQ_PRIORITY                  \
}

namespace {

class FlashLock {
public:
    FlashLock() {
        hal_exflash_lock();
    }
    ~FlashLock() {
        hal_exflash_unlock();
    }
};

hal_exflash_state_t qspi_state = HAL_EXFLASH_STATE_DISABLED;
hal_qspi_flash_type_t flash_type = HAL_QSPI_FLASH_TYPE_UNKNOWN;


// Mitigations for nRF52840 anomaly 215
// [215] QSPI: Reading QSPI registers after XIP might halt CPU
// Conditions
// Init and start QSPI, use XIP, then write to or read any QSPI register with an offset above 0x600.
//
// Consequences
// CPU halts.
//
// Workaround
// Trigger QSPI TASKS_ACTIVATE after XIP is used before accessing any QSPI register with an offset above 0x600.
//
// Our testing showed that another side effect of this anomaly is not a lockup
// but a failure to perform any Custom Instructions that rely on CISTR* registers
// of QSPI peripheral, which are located above offset 0x600.
//
// The mitigation that we are implementing is rather simple. We need to ensure that no XIP
// access occurs while we are performing Custom Instructions and we need to apply the workaround mentioned
// in the anomaly description (QSPI TASKS_ACTIVATE).
// There is a performance penalty because we are disabling RTOS thread scheduling,
// however because we are only doing this for CINSTR, it should be minimal.

void exflash_qspi_activate() {
    nrf_qspi_event_clear(NRF_QSPI, NRF_QSPI_EVENT_READY);
    nrf_qspi_task_trigger(NRF_QSPI, NRF_QSPI_TASK_ACTIVATE);
    while (!nrf_qspi_event_check(NRF_QSPI, NRF_QSPI_EVENT_READY));
}

int exflash_qspi_wait_completion() {
    nrfx_err_t err = NRFX_ERROR_INTERNAL;

    // Certain operations like block erasure, may leave the flash
    // in a weird state where we can't talk to it for substantial periods of time
    // (up to ~30ms, seen in practice). According to the datasheet, the erasure for example may take up to 200ms!
    // Ensure we have initialized comms with the external flash properly by running TASK_ACTIVATE
    // before applying workaround to decrease the time we are staying with RTOS scheduling disabled.
    exflash_qspi_activate();

    do {
#if MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
        // Enter critical section
        os_thread_scheduling(false, nullptr);

        // Run QSPI TASK_ACTIVATE task as a workaround for the anomaly 215
        exflash_qspi_activate();
#endif // MODULE_FUNCTION != MOD_FUNC_BOOTLOADER

        // This may block for up to 1ms (QSPI_DEF_WAIT_TIME_US * QSPI_DEF_WAIT_ATTEMPTS)
        err = nrfx_qspi_mem_busy_check();

#if MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
        // Exit critical section
        os_thread_scheduling(true, nullptr);
#endif // MODULE_FUNCTION != MOD_FUNC_BOOTLOADER

