particle-iot/device-os/hal/src/nRF52840/exflash_hal.cpp
    } while (err == NRFX_ERROR_BUSY);

    return nrf_system_error(err);
}

int exflash_qspi_cinstr_xfer(nrf_qspi_cinstr_conf_t const* p_config, void const* p_tx_buffer, void* p_rx_buffer) {
    // Certain operations like block erasure, may leave the flash
    // in a weird state where we can't talk to it for substantial periods of time
    // (up to ~30ms, seen in practice). According to the datasheet, the erasure for example may take up to 200ms!
    // Ensure we have initialized comms with the external flash properly by running TASK_ACTIVATE
    // before applying workaround to decrease the time we are staying with RTOS scheduling disabled.
    exflash_qspi_activate();

#if MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
    // Enter critical section
    os_thread_scheduling(false, nullptr);

    // Run QSPI TASK_ACTIVATE task as a workaround for the anomaly 215
    exflash_qspi_activate();
#endif // MODULE_FUNCTION != MOD_FUNC_BOOTLOADER

    // This may block for up to 1ms (QSPI_DEF_WAIT_TIME_US * QSPI_DEF_WAIT_ATTEMPTS)
    nrfx_err_t err = nrfx_qspi_cinstr_xfer(p_config, p_tx_buffer, p_rx_buffer);

#if MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
    // Exit critical section
    os_thread_scheduling(true, nullptr);
#endif // MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
    return nrf_system_error(err);
}

int exflash_qspi_cinstr_quick_send(uint8_t opcode, nrf_qspi_cinstr_len_t length, void const* p_tx_buffer) {
    nrf_qspi_cinstr_conf_t config = NRFX_QSPI_DEFAULT_CINSTR(opcode, length);
    return exflash_qspi_cinstr_xfer(&config, p_tx_buffer, nullptr);
}

int perform_write(uintptr_t addr, const uint8_t* data, size_t size) {
    return nrf_system_error(nrfx_qspi_write(data, size, addr));
}

constexpr nrf_qspi_cinstr_len_t get_nrf_cinstr_length(size_t length) {
    nrf_qspi_cinstr_len_t cinstrLen = NRF_QSPI_CINSTR_LEN_1B;
    switch (length) {
        case 1: cinstrLen = NRF_QSPI_CINSTR_LEN_1B; break;
        case 2: cinstrLen = NRF_QSPI_CINSTR_LEN_2B; break;
        case 3: cinstrLen = NRF_QSPI_CINSTR_LEN_3B; break;
        case 4: cinstrLen = NRF_QSPI_CINSTR_LEN_4B; break;
        case 5: cinstrLen = NRF_QSPI_CINSTR_LEN_5B; break;
        case 6: cinstrLen = NRF_QSPI_CINSTR_LEN_6B; break;
        case 7: cinstrLen = NRF_QSPI_CINSTR_LEN_7B; break;
        case 8: cinstrLen = NRF_QSPI_CINSTR_LEN_8B; break;
        case 9: cinstrLen = NRF_QSPI_CINSTR_LEN_9B; break;
        default: break;
    }
    return cinstrLen;
}

constexpr nrf_qspi_writeoc_t get_nrf_write_opcode(hal_qspi_flash_cmd_t write_cmd) {
    nrf_qspi_writeoc_t nrf_write = NRF_QSPI_WRITEOC_PP;
    switch (write_cmd) {
        case HAL_QSPI_CMD_STD_WRITE_PP4O:  nrf_write = NRF_QSPI_WRITEOC_PP4O; break;
        case HAL_QSPI_CMD_STD_WRITE_PP4IO: nrf_write = NRF_QSPI_WRITEOC_PP4IO; break;
        default: break;
    }
    return nrf_write;
}

constexpr nrf_qspi_readoc_t get_nrf_read_opcode(hal_qspi_flash_cmd_t read_cmd) {
    nrf_qspi_readoc_t nrf_read = NRF_QSPI_READOC_FASTREAD;
    switch (read_cmd) {
        case HAL_QSPI_CMD_STD_READ_4IO:  nrf_read = NRF_QSPI_READOC_READ4IO; break;
        default: break;
    }
    return nrf_read;
}

int mx25_enter_secure_otp() {
    return exflash_qspi_cinstr_quick_send(HAL_QSPI_CMD_MX25_ENSO, get_nrf_cinstr_length(1), nullptr);
}

int mx25_exit_secure_otp() {
    return exflash_qspi_cinstr_quick_send(HAL_QSPI_CMD_MX25_EXSO, get_nrf_cinstr_length(1), nullptr);
}

int mx25r64_switch_to_qspi() {
    nrf_qspi_cinstr_conf_t cinstr_cfg = NRF_QSPI_DEFAULT_CINSTR(HAL_QSPI_CMD_STD_WRSR, get_nrf_cinstr_length(4));
    // Status register, configuration register 1, configuration register 2 values
    uint8_t config_values[3] = { 0x40, 0x00, 0x02 };
    return exflash_qspi_cinstr_xfer(&cinstr_cfg, config_values, nullptr);
}

int mx25l32_switch_to_qspi() {
    nrf_qspi_cinstr_conf_t cinstr_cfg = NRF_QSPI_DEFAULT_CINSTR(HAL_QSPI_CMD_STD_WRSR, get_nrf_cinstr_length(2));
    uint8_t status_register[1] = { 0x40 };
    return exflash_qspi_cinstr_xfer(&cinstr_cfg, status_register, nullptr);
}

int gd25_switch_to_qspi() {
    nrf_qspi_cinstr_conf_t cinstr_cfg = NRF_QSPI_DEFAULT_CINSTR(HAL_QSPI_CMD_STD_WRSR, get_nrf_cinstr_length(2));
    uint8_t status_registers[3] = {0x00, 0x02, 0x00};

    CHECK(exflash_qspi_cinstr_xfer(&cinstr_cfg, &status_registers[0], nullptr));
    
    cinstr_cfg.opcode = HAL_QSPI_CMD_GD25_WRSR2;
    CHECK(exflash_qspi_cinstr_xfer(&cinstr_cfg, &status_registers[1], nullptr));

    cinstr_cfg.opcode = HAL_QSPI_CMD_GD25_WRSR3;
    CHECK(exflash_qspi_cinstr_xfer(&cinstr_cfg, &status_registers[2], nullptr));

    return 0;
}

int gd25_secure_register_read(uint8_t security_registers_index, uint32_t security_registers_addr, void* buf, size_t size) {
    CHECK_TRUE(security_registers_index < HAL_QSPI_FLASH_OTP_SECTOR_COUNT_GD25, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(security_registers_addr + size <= HAL_QSPI_FLASH_OTP_SIZE_GD25, SYSTEM_ERROR_INVALID_ARGUMENT);

    nrf_qspi_cinstr_conf_t readSecurityRegister = NRF_QSPI_DEFAULT_CINSTR(HAL_QSPI_CMD_GD25_SEC_READ, get_nrf_cinstr_length(1));

    // 3 bytes of address data + 1 byte of dummy data
    uint8_t addrBuf[4] = {}; 
    uint32_t address = ((security_registers_index + 1) << 12) + security_registers_addr;
    addrBuf[0] = (uint8_t)((address>>16) & 0xFF);
    addrBuf[1] = (uint8_t)((address>>8) & 0xFF);
    addrBuf[2] = (uint8_t)((address>>0) & 0xFF);
    addrBuf[3] = 0x00;

    // start long frame transfer with "Read Security Register" opcode
    nrfx_err_t ret = nrfx_qspi_lfm_start(&readSecurityRegister);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    nrf_delay_us(10); // need a bit delay to switch between normal flash and security register
    // Send address + dummy bytes, do not finalize long frame transfer
    ret = nrfx_qspi_lfm_xfer(addrBuf, nullptr, sizeof(addrBuf), false);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    // Read security register data, finalize long frame transfer
    ret = nrfx_qspi_lfm_xfer(nullptr, buf, size, true);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));

