particle-iot/device-os/hal/src/nRF52840/exflash_hal.cpp
    return 0;
}

int gd25_secure_register_write(uint8_t security_registers_index, uint32_t security_registers_addr, void* buf, size_t size) {
    CHECK_TRUE(security_registers_index < HAL_QSPI_FLASH_OTP_SECTOR_COUNT_GD25, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(security_registers_addr + size <= HAL_QSPI_FLASH_OTP_SIZE_GD25, SYSTEM_ERROR_INVALID_ARGUMENT);

    nrf_qspi_cinstr_conf_t writeSecurityRegister = NRF_QSPI_DEFAULT_CINSTR(HAL_QSPI_CMD_GD25_SEC_PROGRAM, get_nrf_cinstr_length(1));

    uint32_t address = 0;
    uint8_t addrBuf[3] = {};
    address = ((security_registers_index + 1) << 12) + security_registers_addr;
    addrBuf[0] = (uint8_t)((address>>16) & 0xFF);
    addrBuf[1] = (uint8_t)((address>>8) & 0xFF);
    addrBuf[2] = (uint8_t)((address>>0) & 0xFF);

    nrfx_err_t ret = nrfx_qspi_lfm_start(&writeSecurityRegister);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    nrf_delay_us(10); // need a bit delay to switch between normal flash and security register
    // Send address bytes, do not finalize long frame transfer
    ret = nrfx_qspi_lfm_xfer(addrBuf, nullptr, sizeof(addrBuf), false);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    // Send data to write, finalize long frame transfer
    ret = nrfx_qspi_lfm_xfer((const void *)buf, nullptr, size, true);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));

    return 0;
}

int gd25_security_register_operation(hal_exflash_gd25_security_register_read_write operation, uintptr_t addr, uint8_t* data_buf, size_t data_size) {
    // Determine which OTP Register to start operating from
    size_t otp_page = addr / HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25;
    size_t data_to_process = data_size;
    size_t data_processed = 0;
    size_t data_to_process_this_operation = 0;
    int ret = 0;

    while (data_to_process && !ret) {
        // Determine the offset of the current OTP register to start reading from
        size_t register_offset = (addr + data_processed) % HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25;
        data_to_process_this_operation = data_to_process;

        // If the data remaining to read extends into the next register, truncate the read amount to fit into this register
        if (register_offset + data_to_process_this_operation > HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25){
            data_to_process_this_operation = HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25 - register_offset;
        }

        ret = operation(otp_page, register_offset, &data_buf[data_processed], data_to_process_this_operation);

        // Increment/decrement counter variables, increment to the next OTP register
        data_to_process -= data_to_process_this_operation;
        data_processed += data_to_process_this_operation;
        otp_page++;
    }

    return ret;
}

int erase_common(uintptr_t start_addr, size_t num_blocks, nrf_qspi_erase_len_t len) {
    FlashLock lk;

    int err_code = NRF_SUCCESS;

    const size_t block_length = len == NRF_QSPI_ERASE_LEN_4KB ? 4096 : 64 * 1024;

    /* Round down to the nearest block */
    start_addr = ((start_addr / block_length) * block_length);

    for (size_t i = 0; i < num_blocks; i++) {
        err_code = nrfx_qspi_erase(len, start_addr);
        CHECK_NRF_RETURN(err_code, nrf_system_error(err_code));

        exflash_qspi_wait_completion();

        start_addr += block_length;
    }

    // LOG_DEBUG(TRACE, "Erased %lu %lukB blocks starting from %" PRIxPTR,
    //           num_blocks, block_length / 1024, start_addr);

    return 0;
}

} // Anonymous

int hal_exflash_init(void) {
    // PATCH: Initialize CS pin, external memory discharge
    nrf_gpio_cfg_output(QSPI_FLASH_CSN_PIN);
    nrf_gpio_pin_set(QSPI_FLASH_CSN_PIN);
    nrf_gpio_cfg_input(QSPI_FLASH_IO1_PIN, NRF_GPIO_PIN_PULLDOWN);

    FlashLock lk;

    hal_qspi_flash_type_t all_flashes[] = {
        HAL_QSPI_FLASH_TYPE_MX25L3233F,
        HAL_QSPI_FLASH_TYPE_MX25R6435F,
        HAL_QSPI_FLASH_TYPE_GD25WQ64E
    };

    // Use single data line SPI to read ID
    nrfx_qspi_config_t default_config = NRF_QSPI_QUICK_CFG(NRF_QSPI_WRITEOC_PP, NRF_QSPI_READOC_FASTREAD, NRF_QSPI_FREQ_32MDIV2);
    int ret = nrfx_qspi_init(&default_config, nullptr, nullptr);
    if (ret == NRFX_ERROR_TIMEOUT) {
        // Could have timed out because the flash chip might be in an ongoing program/erase operation or Deep Power-Down mode.
        // Suspend it or wake it up.
        LOG_DEBUG(TRACE, "QSPI NRFX timeout error. Suspend pgm/ers op or wake it up.");

        // Try all the supported suspend command
        for (auto flash: all_flashes) {
            flash_type = flash;
            hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_SUSPEND_PGMERS, nullptr, nullptr, 0);
            nrf_delay_us(20); // Need delay to ensure the flash is suspended
        }
    }

    // Determine chip type / wake up from potential sleep
    uint8_t chip_id[3] = {};

    // Temporarily set the flash type to make use of hal_exflash_special_command()
    flash_type = DEFAULT_SPI_FLASH_TYPE;
    if (!hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_READID, nullptr, chip_id, 0)) {
        // Try all the supported wake-up command
        for (auto flash: all_flashes) {
            flash_type = flash;
            hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_WAKEUP, nullptr, nullptr, 0);
            nrf_delay_us(20); // Need delay to ensure the flash is woken up.
        }

        // Read ID must succeed at this point
        CHECK(hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_READID, nullptr, chip_id, 0));
    }

    flash_type = hal_exflash_get_type(chip_id);
    const hal_exflash_params_t* flash_params = hal_exflash_get_params(flash_type);

    // Re-initialize QSPI using corresponding flash parameters
    nrfx_qspi_uninit();
    nrfx_qspi_config_t new_config = NRF_QSPI_QUICK_CFG(get_nrf_write_opcode(flash_params->write_opcode), 
                                                       get_nrf_read_opcode(flash_params->read_opcode), 
                                                       NRF_QSPI_FREQ_32MDIV2);
    ret = nrfx_qspi_init(&new_config, nullptr, nullptr);
    CHECK_NRF_RETURN(ret, nrf_system_error(ret));
    qspi_state = HAL_EXFLASH_STATE_ENABLED;

    // Reset chip, put it into QSPI mode
    CHECK(hal_exflash_special_command(HAL_EXFLASH_SPECIAL_SECTOR_NONE, HAL_EXFLASH_COMMAND_RESET, nullptr, nullptr, 0));

    return SYSTEM_ERROR_NONE;
}

